class gVerses {

  List _verses = new List();
  int _index=-1;

  gVerses() {
    init(_verses);
  }

  init(_verses){
    _verses.add('ولا يخطر لك البتة أنك تستطيع أن تتسلط على مسالك المحبة, لأن المحبة إن رأت فيك استحقاقاً لنعمتها, تتسلط هي على مسالكك');
    _verses.add('والمحبة لا رغبة لها إلا في أن تكمل نفسها');
    _verses.add(   'ولكن, إذا أحببت, وكان لا بد من أن تكون لك رغبات خاصة بك, فلتكن هذه رغباتك');
    _verses.add(   'أن تذوب وتكون كجدول متدفق يشنف آذان الليل بأنغامه');
    _verses.add(   'أن تخبر الآلام التي في العطف المتناهي');
    _verses.add(  'أن يجرحك إدراكك الحقيقي للمحبة في حبة قلبك, وأن تنزف دماؤك وأنت راض مغتبط');
    _verses.add(   'أن تنهض عند الفجر بقلب مجنح خفوق, قتؤدي واجب الشكر ملتمساً يوم محبة آخر');
    _verses.add(   'أن تستريح عند الظهيرة وتناخي نفسك بوجد المحبة');
    _verses.add(   'أن تعود إلى منزلك عند المساء شاكراً');
    _verses.add(   'فتنام حينئذ والصلاة لأجل من أحببت تتردد في قلبك, وأنشودة الحمد والثناء مرتمسة على شفتيك');
  }

  String nextVerse(){
    _index = (_index +1) % _verses.length;
    return(_verses[_index]);
  }

}

/*
main(){

  gVerses g = new gVerses();

  while(true){
   print(g.nextVerse());
  }
}

 */